app/controllers/groups_controller.rb

SELECT * FROM "groups" WHERE ("groups"."id" = 0)
---
  def show
    @group = Group.find(params[:id])